# DivideVolumesSketchesWithProfileUnfriendlyCurves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivideVolumesSketchesWithProfileUnfriendlyCurves Property
BuiltInFailures..::..DPartFailures Class See Also
---
Sketch contains curves to which profiles cannot be applied or chains of curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivideVolumesSketchesWithProfileUnfriendlyCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivideVolumesSketchesWithProfileUnfriendlyCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivideVolumesSketchesWithProfileUnfriendlyCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace